// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

Console.WriteLine("Введите число и программа определит является ли число четным");
int a;

Console.WriteLine("Введите число: ");
a = Convert.ToInt32(Console.ReadLine());

if (a % 2==1)
{
    Console.WriteLine("Число нечетное");
}
else 
{
    Console.WriteLine("Число четное");
}